# Aggregating Data

In [2]:
import pandas as pd

bios = pd.read_csv("../data/bios.csv")
coffee = pd.read_csv("../warmup-data/coffee.csv")
coffee['Price'] = coffee['Coffee Type'].apply(lambda x: 3.55 if x == 'Espresso' else 5.99)
coffee['Revenue'] = coffee['Units Sold'] * coffee['Price']
coffee

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso          25   3.55    88.75
1      Monday       Latte          15   5.99    89.85
2     Tuesday    Espresso          30   3.55   106.50
3     Tuesday       Latte          20   5.99   119.80
4   Wednesday    Espresso          35   3.55   124.25
5   Wednesday       Latte          25   5.99   149.75
6    Thursday    Espresso          40   3.55   142.00
7    Thursday       Latte          30   5.99   179.70
8      Friday    Espresso          45   3.55   159.75
9      Friday       Latte          35   5.99   209.65
10   Saturday    Espresso          45   3.55   159.75
11   Saturday       Latte          35   5.99   209.65
12     Sunday    Espresso          45   3.55   159.75
13     Sunday       Latte          35   5.99   209.65

In [6]:
# value count

bios['born_country'].value_counts()

born_country
USA       9641
GER       6891
GBR       5792
FRA       5143
ITA       4709
          ...
SEY          1
SMT          1
COK          1
Corfu        1
Aarhus       1
Name: count, Length: 236, dtype: int64

In [ ]:
# combine two condition to count

bios[bios['born_country'] == 'USA']['born_region'].value_counts().head()

born_region
California       1634
New York          990
Illinois          585
Massachusetts     530
Pennsylvania      530
Name: count, dtype: int64

In [28]:
# Group by

coffee.groupby(['Coffee Type'])['Units Sold'].sum()

Coffee Type
Espresso    265
Latte       195
Name: Units Sold, dtype: int64

In [30]:
coffee.groupby(['Coffee Type']).agg({'Units Sold' : 'sum', 'Price' : 'mean'})

             Units Sold  Price
Coffee Type
Espresso            265   3.66
Latte               195   3.66

In [34]:
# .pivot

pivot = coffee.pivot(columns = 'Coffee Type', index='Day', values='Revenue')
pivot

Coffee Type  Espresso   Latte
Day
Friday         159.75  209.65
Monday          88.75   89.85
Saturday       159.75  209.65
Sunday         159.75  209.65
Thursday       142.00  179.70
Tuesday        106.50  119.80
Wednesday      124.25  149.75

In [38]:
pivot.loc['Monday','Latte']

np.float64(89.85000000000001)

In [42]:
pivot.sum(axis=0)

Coffee Type
Espresso     940.75
Latte       1168.05
dtype: float64

In [41]:
pivot.sum(axis=1)

Day
Friday       369.4
Monday       178.6
Saturday     369.4
Sunday       369.4
Thursday     321.7
Tuesday      226.3
Wednesday    274.0
dtype: float64

In [19]:
# group by the born_date
bios['born_date'] = pd.to_datetime(bios['born_date'])
bios['born_year'] = bios['born_date'].dt.year
bios['born_month'] = bios['born_date'].dt.month



bios.groupby([bios['born_year'], bios['born_month']])['name'].count().reset_index().sort_values('name',ascending=False)

      born_year  born_month  name
1437     1970.0         1.0   239
1461     1972.0         1.0   229
1497     1975.0         1.0   227
1629     1986.0         1.0   227
1617     1985.0         1.0   225
...         ...         ...   ...
1877     2006.0        12.0     1
1871     2006.0         3.0     1
20       1846.0         7.0     1
21       1846.0         8.0     1
22       1846.0         9.0     1

[1885 rows x 3 columns]